TexasInstruments/mcupsdk-core/examples/drivers/epwm/epwm_illegal_combo_logic/am263px-cc/r5fss0-0_nortos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263Px" --package "ZCZ_S" --part "AM263P4" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.18.0+3266"}
 */

/**
 * Import the modules used in this configuration.
 */
const pmic            = scripting.addModule("/board/pmic/pmic", {}, false);
const pmic1           = pmic.addInstance();
const epwm            = scripting.addModule("/drivers/epwm/epwm", {}, false);
const epwm1           = epwm.addInstance();
const epwm2           = epwm.addInstance();
const epwm3           = epwm.addInstance();
const epwm4           = epwm.addInstance();
const epwm5           = epwm.addInstance();
const epwm6           = epwm.addInstance();
const epwm7           = epwm.addInstance();
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();
const section8        = section.addInstance();
const section9        = section.addInstance();
const section10       = section.addInstance();
const section11       = section.addInstance();
const section12       = section.addInstance();
const epwm_xbar       = scripting.addModule("/xbar/epwm_xbar/epwm_xbar", {}, false);
const epwm_xbar1      = epwm_xbar.addInstance();
const icl_xbar        = scripting.addModule("/xbar/icl_xbar/icl_xbar", {}, false);
const icl_xbar1       = icl_xbar.addInstance();
const icl_xbar2       = icl_xbar.addInstance();
const icl_xbar3       = icl_xbar.addInstance();
const icl_xbar4       = icl_xbar.addInstance();
const icl_xbar5       = icl_xbar.addInstance();
const icl_xbar6       = icl_xbar.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
pmic1.$name = "CONFIG_PMIC0";

epwm1.$name                                                    = "CONFIG_EPWM0";
epwm1.epwmXCMP_SplitCheck                                      = true;
epwm1.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm1.epwmTimebase_period                                      = 24000;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_PERIOD  = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_PERIOD  = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT1                = "EPWM_TZ_ACTION_HIGH";
epwm1.epwmDigitalCompare_EPWM_TZ_DC_OUTPUT_A1                  = "EPWM_TZ_EVENT_DCXH_HIGH";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                    = "EPWM_TZ_ACTION_DISABLE";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                    = "EPWM_TZ_ACTION_DISABLE";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT2                = "EPWM_TZ_ACTION_DISABLE";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT1                = "EPWM_TZ_ACTION_DISABLE";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT2                = "EPWM_TZ_ACTION_DISABLE";
epwm1.epwmCounterCompare_cmpA                                  = 20000;
epwm1.epwmTimebase_syncInPulseSource                           = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM1";
epwm1.epwmICL_useICLB                                          = true;
epwm1.epwmICLB_LUTDEC_1                                        = "1";
epwm1.epwmICLB_LUTDEC_5                                        = "1";
epwm1.EPWM.$assign                                             = "EPWM0";

epwm2.$name                                                    = "CONFIG_EPWM1";
epwm2.epwmCounterCompare_cmpA                                  = 8000;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmCounterCompare_cmpB                                  = 9000;
epwm2.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP_DOWN";
epwm2.epwmTimebase_period                                      = 24000;
epwm2.epwmTimebase_syncOutPulseMode                            = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO"];
epwm2.EPWM.$assign                                             = "EPWM1";

epwm3.$name              = "CONFIG_EPWM2";
epwm3.epwmICL_useICLA    = true;
epwm3.epwmICL_useICLB    = true;
epwm3.epwmICLB_IN3source = "1";
epwm3.epwmICLA_LUTDEC_4  = "1";
epwm3.epwmICLA_LUTDEC_5  = "1";
epwm3.epwmICLA_LUTDEC_6  = "1";
epwm3.epwmICLA_LUTDEC_7  = "1";
epwm3.epwmICLB_LUTDEC_4  = "1";
epwm3.epwmICLB_LUTDEC_5  = "1";
epwm3.epwmICLB_LUTDEC_6  = "1";
epwm3.epwmICLB_LUTDEC_7  = "1";
epwm3.EPWM.$assign       = "EPWM2";

epwm4.$name                                                      = "CONFIG_EPWM3";
epwm4.epwmTimebase_period                                        = 24000;
epwm4.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm4.epwmCounterCompare_cmpA                                    = 8000;
epwm4.epwmCounterCompare_cmpB                                    = 16000;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO      = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_PERIOD    = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPB   = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_PERIOD    = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO      = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmICL_useICLA                                            = true;
epwm4.epwmICL_useICLB                                            = true;
epwm4.epwmICLA_LUTDEC_1                                          = "1";
epwm4.epwmICLA_LUTDEC_2                                          = "1";
epwm4.epwmICLA_LUTDEC_5                                          = "1";
epwm4.epwmICLA_LUTDEC_6                                          = "1";
epwm4.epwmICLB_LUTDEC_0                                          = "1";
epwm4.epwmICLB_LUTDEC_4                                          = "1";
epwm4.epwmICLB_LUTDEC_3                                          = "1";
epwm4.epwmICLB_LUTDEC_7                                          = "1";
epwm4.epwmTimebase_syncOutPulseMode                              = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO"];
epwm4.EPWM.$assign                                               = "EPWM3";

epwm5.$name              = "CONFIG_EPWM4";
epwm5.epwmICL_useICLA    = true;
epwm5.epwmICL_useICLB    = true;
epwm5.epwmICLA_LUTDEC_4  = "1";
epwm5.epwmICLA_LUTDEC_5  = "1";
epwm5.epwmICLA_LUTDEC_6  = "1";
epwm5.epwmICLA_LUTDEC_7  = "1";
epwm5.epwmICLB_LUTDEC_4  = "1";
epwm5.epwmICLB_LUTDEC_5  = "1";
epwm5.epwmICLB_LUTDEC_6  = "1";
epwm5.epwmICLB_LUTDEC_7  = "1";
epwm5.epwmICLA_IN3source = "2";
epwm5.epwmICLB_IN3source = "3";
epwm5.EPWM.$assign       = "EPWM4";

epwm6.$name                                                      = "CONFIG_EPWM5";
epwm6.epwmTimebase_period                                        = 24000;
epwm6.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm6.epwmTimebase_syncInPulseSource                             = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM3";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO      = "EPWM_AQ_OUTPUT_LOW";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_PERIOD    = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPB   = "EPWM_AQ_OUTPUT_LOW";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO      = "EPWM_AQ_OUTPUT_LOW";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_PERIOD    = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmCounterCompare_cmpA                                    = 8000;
epwm6.epwmCounterCompare_cmpB                                    = 16000;
epwm6.epwmICL_useICLA                                            = true;
epwm6.epwmICL_useICLB                                            = true;
epwm6.epwmICLA_LUTDEC_0                                          = "1";
epwm6.epwmICLA_LUTDEC_1                                          = "1";
epwm6.epwmICLA_LUTDEC_2                                          = "1";
epwm6.epwmICLA_LUTDEC_5                                          = "1";
epwm6.epwmICLA_LUTDEC_4                                          = "1";
epwm6.epwmICLA_LUTDEC_6                                          = "1";
epwm6.epwmICLB_LUTDEC_0                                          = "1";
epwm6.epwmICLB_LUTDEC_4                                          = "1";
epwm6.EPWM.$assign                                               = "EPWM5";

