TexasInstruments/mcupsdk-core/examples/drivers/epwm/epwm_illegal_combo_logic/am263px-cc/r5fss0-0_nortos/example.syscfg
icl_xbar1.$name      = "CONFIG_ICL_XBAR0";
icl_xbar1.xbarOutput = ["MDL0_OUTA"];

icl_xbar2.$name      = "CONFIG_ICL_XBAR1";
icl_xbar2.xbarOutput = ["MDL0_OUTB"];
icl_xbar2.instance   = "ICL_XBAR_1";

icl_xbar3.$name      = "CONFIG_ICL_XBAR2";
icl_xbar3.xbarOutput = ["MDL3_OUTA"];
icl_xbar3.instance   = "ICL_XBAR_2";

icl_xbar4.$name      = "CONFIG_ICL_XBAR3";
icl_xbar4.xbarOutput = ["MDL3_OUTB"];
icl_xbar4.instance   = "ICL_XBAR_3";

icl_xbar5.$name      = "CONFIG_ICL_XBAR4";
icl_xbar5.xbarOutput = ["MDL5_OUTA"];
icl_xbar5.instance   = "ICL_XBAR_4";

icl_xbar6.$name      = "CONFIG_ICL_XBAR5";
icl_xbar6.xbarOutput = ["MDL5_OUTB"];
icl_xbar6.instance   = "ICL_XBAR_5";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.EPWM.A.$suggestSolution               = "EPWM0_A";
epwm1.EPWM.B.$suggestSolution               = "EPWM0_B";
epwm2.EPWM.A.$suggestSolution               = "EPWM1_A";
epwm2.EPWM.B.$suggestSolution               = "EPWM4_B";
epwm3.EPWM.A.$suggestSolution               = "EPWM2_A";
epwm3.EPWM.B.$suggestSolution               = "EPWM2_B";
epwm4.EPWM.A.$suggestSolution               = "EPWM3_A";
epwm4.EPWM.B.$suggestSolution               = "EPWM6_A";
epwm5.EPWM.A.$suggestSolution               = "EPWM4_A";
epwm5.EPWM.B.$suggestSolution               = "EPWM1_B";
epwm6.EPWM.A.$suggestSolution               = "EPWM5_A";
epwm6.EPWM.B.$suggestSolution               = "EPWM5_B";
epwm7.EPWM.A.$suggestSolution               = "EPWM3_B";
epwm7.EPWM.B.$suggestSolution               = "EPWM6_B";
mcspi1.SPI.$suggestSolution                 = "SPI1";
mcspi1.SPI.CLK.$suggestSolution             = "SPI1_CLK";
mcspi1.SPI.D0.$suggestSolution              = "SPI1_D0";
mcspi1.SPI.D1.$suggestSolution              = "SPI1_D1";
mcspi1.mcspiChannel[0].CSn.$suggestSolution = "SPI1_CS0";
debug_log.uartLog.UART.$suggestSolution     = "UART0";
